app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "description", "duration", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-04-19 04:04:27.646429"], ["description", "Hahah"], ["duration", "2-3 days"], ["title", "Sportsfest"], ["updated_at", "2015-04-19 04:04:27.646429"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save